counhopig/inkpaper-firmware/rust-firmware/sdkconfig.defaults
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# CONFIG_ESPTOOLPY_OCT_FLASH is not set

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="${CMAKE_CURRENT_SOURCE_DIR}/../../../../../../partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="${CMAKE_CURRENT_SOURCE_DIR}/../../../../../../partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_NVS_ENABLED=y
CONFIG_ADC_ONESHOT_ENABLED=y
CONFIG_I2C=y
CONFIG_I2C_ENABLE_DEBUG_LOG=n
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# Task watchdog: catch a genuine hang (stuck peripheral, a future infinite
# loop) and reboot instead of leaving the device stuck. 10s gives headroom
# over the longest observed single blocking call (Wi-Fi scan, ~2.5s) while
# still catching anything that's actually stuck. See src/watchdog.rs.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y
